app/views/restaurants/index.html.haml

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
---
        %ul
          - restaurant.reviews.each do |review|

SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 1]]
---
              = link_to "Endorse", review_endorsements_path(review), class: 'endorsements-link'
              %span.endorsements_count= review.endorsements.count