app/views/restaurants/show.html.haml

    %h4= @restaurant.description
    - @restaurant.reviews.all.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]