app/controllers/endorsements_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "endorsements" ("review_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["review_id", 8], ["created_at", "2016-08-26 11:12:41.333190"], ["updated_at", "2016-08-26 11:12:41.333190"]]
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 8]]
---
def create
  @review = Review.find(params[:review_id])
  @review.endorsements.create
  render json: {new_endoresement_count: @review.endorsements.count}