app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mc'Do"], ["description", "burgers "], ["user_id", 1], ["created_at", "2016-08-25 11:15:08.875923"], ["updated_at", "2016-08-25 11:15:08.875923"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save